readInputFile> Parsing file input_field

readInputFile> Detected keyword ModeAndScheme
               mode=1 => mapNF at diff. lambda and diff. Inc. and Sca_angles
               scheme=2 => Seek T^(ji) using Stout's iterative scheme
readInputFile> Detected keyword MultipoleCutoff
               Supplied ncut(1)=  2
               Setting ncut(2)= ncut(1)
               Setting ncut(3)=  -8
readInputFile> Detected keyword MultipoleSelections
               selection 1: EE1:1_EM2:1_ME2:1_MM2:1 blocks
                            T-block | n_lo | n_hi 
                             MM/11      2      1
                             EM/21      2      1
                             ME/12      2      1
                             EE/22      1      1
readInputFile> Detected keyword Wavelength
               Wavelength (nm):   514.0000
readInputFile> Detected keyword OutputFormat
               OutputFormat=HDF5
               All output files are stored in file "map_FIELD.h5                                                    "
readInputFile> Detected keyword ScattererCentredCrossSections
readInputFile> Detected keyword SpacePoints
               i,lb_i,ub_i,npts_i= 1  1.20000000000000000E+02  2.03000000000000000E+03  800
               i,lb_i,ub_i,npts_i= 2 -1.00000000000000000E+02  8.90000000000000000E+02  200
               i,lb_i,ub_i,npts_i= 3  0.00000000000000000E+00  0.00000000000000000E+00    0
               nGridPoints=    161001
readInputFile> Detected keyword Incidence
               Incidence filename= incidence
               Expected incidence count=      2
readInputFile> X-linear polarization
               Incident Euler angles and weights:
                  alpha        beta        gamma        weight
               0.00000000   0.00000000   0.00000000   0.50000000
               1.57079600   0.00000000   0.00000000   0.50000000
readInputFile> Detected keyword MapQuantity
               Map enhancement |E|**p with p=   2

readInputFile> Detected keyword Scatterers
 with nscat=  169

readInputFile> Descriptor(s) and circumscribing sphere(s):

 scatID String                  x          y          z         R_0
    1   Au                  2.2000E+2  7.9000E+2  0.0000E+0  1.8000E+1
    2   Ag                  2.2000E+2  7.3000E+2  0.0000E+0  1.2000E+1
    3   Au                  2.2000E+2  5.5000E+2  0.0000E+0  1.8000E+1
    4   Au                  2.2000E+2  3.1000E+2  0.0000E+0  1.8000E+1
    5   Au                  2.2000E+2  6.7000E+2  0.0000E+0  1.8000E+1
    6   Au                  2.2000E+2  4.3000E+2  0.0000E+0  1.8000E+1
    7   Ag                  2.2000E+2  4.9000E+2  0.0000E+0  1.2000E+1
    8   Au                  2.2000E+2  2.5000E+2  0.0000E+0  1.8000E+1
    9   Au                  2.2000E+2  6.1000E+2  0.0000E+0  1.8000E+1
   10   Au                  2.2000E+2  3.7000E+2  0.0000E+0  1.8000E+1
   11   Au                  7.6000E+2  5.4000E+2  0.0000E+0  1.8000E+1
   12   Au                  1.1500E+3  7.9000E+2  0.0000E+0  1.8000E+1
   13   Au                  1.5700E+3  7.9000E+2  0.0000E+0  1.8000E+1
   14   Au                  1.8700E+3  7.9000E+2  0.0000E+0  1.8000E+1
   15   Ag                  7.6000E+2  4.8000E+2  0.0000E+0  1.2000E+1
   16   Au                  1.1500E+3  7.3000E+2  0.0000E+0  1.8000E+1
   17   Ag                  1.5700E+3  7.3000E+2  0.0000E+0  1.2000E+1
   18   Au                  1.8700E+3  7.3000E+2  0.0000E+0  1.8000E+1
   19   Au                  7.6000E+2  3.0000E+2  0.0000E+0  1.8000E+1
   20   Ag                  1.1500E+3  5.5000E+2  0.0000E+0  1.2000E+1
   21   Au                  1.5700E+3  5.5000E+2  0.0000E+0  1.8000E+1
   22   Au                  1.8700E+3  5.5000E+2  0.0000E+0  1.8000E+1
   23   Au                  7.6000E+2  6.0000E+1  0.0000E+0  1.8000E+1
   24   Ag                  1.1500E+3  3.1000E+2  0.0000E+0  1.2000E+1
   25   Au                  1.5700E+3  3.1000E+2  0.0000E+0  1.8000E+1
   26   Au                  1.8700E+3  3.1000E+2  0.0000E+0  1.8000E+1
   27   Au                  7.6000E+2  4.2000E+2  0.0000E+0  1.8000E+1
   28   Au                  1.1500E+3  6.7000E+2  0.0000E+0  1.8000E+1
   29   Au                  1.5700E+3  6.7000E+2  0.0000E+0  1.8000E+1
   30   Au                  1.8700E+3  6.7000E+2  0.0000E+0  1.8000E+1
   31   Au                  7.6000E+2  1.8000E+2  0.0000E+0  1.8000E+1
   32   Au                  1.1500E+3  4.3000E+2  0.0000E+0  1.8000E+1
   33   Ag                  1.5700E+3  4.3000E+2  0.0000E+0  1.2000E+1
   34   Au                  1.8700E+3  4.3000E+2  0.0000E+0  1.8000E+1
   35   Ag                  7.6000E+2  2.4000E+2  0.0000E+0  1.2000E+1
   36   Au                  1.1500E+3  4.9000E+2  0.0000E+0  1.8000E+1
   37   Au                  1.5700E+3  4.9000E+2  0.0000E+0  1.8000E+1
   38   Ag                  1.8700E+3  4.9000E+2  0.0000E+0  1.2000E+1
   39   Au                  7.6000E+2  0.0000E+0  0.0000E+0  1.8000E+1
   40   Au                  1.1500E+3  2.5000E+2  0.0000E+0  1.8000E+1
   41   Au                  1.5700E+3  2.5000E+2  0.0000E+0  1.8000E+1
   42   Au                  2.8000E+2  7.9000E+2  0.0000E+0  1.8000E+1
   43   Au                  2.8000E+2  7.3000E+2  0.0000E+0  1.8000E+1
   44   Au                  2.8000E+2  5.5000E+2  0.0000E+0  1.8000E+1
   45   Ag                  2.8000E+2  3.1000E+2  0.0000E+0  1.2000E+1
   46   Au                  2.8000E+2  6.7000E+2  0.0000E+0  1.8000E+1
   47   Au                  2.8000E+2  4.3000E+2  0.0000E+0  1.8000E+1
   48   Au                  2.8000E+2  4.9000E+2  0.0000E+0  1.8000E+1
   49   Au                  2.8000E+2  2.5000E+2  0.0000E+0  1.8000E+1
   50   Au                  2.8000E+2  6.1000E+2  0.0000E+0  1.8000E+1
   51   Au                  2.8000E+2  3.7000E+2  0.0000E+0  1.8000E+1
   52   Au                  7.6000E+2  3.6000E+2  0.0000E+0  1.8000E+1
   53   Au                  1.1500E+3  6.1000E+2  0.0000E+0  1.8000E+1
   54   Au                  1.5700E+3  6.1000E+2  0.0000E+0  1.8000E+1
   55   Au                  1.8700E+3  6.1000E+2  0.0000E+0  1.8000E+1
   56   Au                  7.6000E+2  1.2000E+2  0.0000E+0  1.8000E+1
   57   Au                  1.1500E+3  3.7000E+2  0.0000E+0  1.8000E+1
   58   Au                  1.5700E+3  3.7000E+2  0.0000E+0  1.8000E+1
   59   Au                  1.8700E+3  3.7000E+2  0.0000E+0  1.8000E+1
   60   Au                  3.4000E+2  7.9000E+2  0.0000E+0  1.8000E+1
   61   Au                  3.4000E+2  7.3000E+2  0.0000E+0  1.8000E+1
   62   Au                  3.4000E+2  5.5000E+2  0.0000E+0  1.8000E+1
   63   Au                  3.4000E+2  4.9000E+2  0.0000E+0  1.8000E+1
   64   Au                  4.6000E+2  7.9000E+2  0.0000E+0  1.8000E+1
   65   Au                  4.6000E+2  7.3000E+2  0.0000E+0  1.8000E+1
   66   Au                  4.6000E+2  5.5000E+2  0.0000E+0  1.8000E+1
   67   Au                  4.6000E+2  4.9000E+2  0.0000E+0  1.8000E+1
   68   Au                  6.0000E+2  6.4000E+2  0.0000E+0  1.8000E+1
   69   Ag                  6.0000E+2  5.8000E+2  0.0000E+0  1.2000E+1
   70   Au                  6.0000E+2  4.0000E+2  0.0000E+0  1.8000E+1
   71   Au                  6.0000E+2  5.2000E+2  0.0000E+0  1.8000E+1
   72   Au                  6.0000E+2  2.8000E+2  0.0000E+0  1.8000E+1
   73   Ag                  6.0000E+2  3.4000E+2  0.0000E+0  1.2000E+1
   74   Au                  8.2000E+2  5.4000E+2  0.0000E+0  1.8000E+1
   75   Au                  1.2100E+3  7.9000E+2  0.0000E+0  1.8000E+1
   76   Au                  1.6300E+3  7.9000E+2  0.0000E+0  1.8000E+1
   77   Au                  8.2000E+2  4.8000E+2  0.0000E+0  1.8000E+1
   78   Ag                  1.2100E+3  7.3000E+2  0.0000E+0  1.2000E+1
   79   Au                  1.6300E+3  7.3000E+2  0.0000E+0  1.8000E+1
   80   Au                  1.9300E+3  7.3000E+2  0.0000E+0  1.8000E+1
   81   Au                  4.0000E+2  7.9000E+2  0.0000E+0  1.8000E+1
   82   Ag                  4.0000E+2  7.3000E+2  0.0000E+0  1.2000E+1
   83   Au                  4.0000E+2  5.5000E+2  0.0000E+0  1.8000E+1
   84   Ag                  4.0000E+2  4.9000E+2  0.0000E+0  1.2000E+1
   85   Au                  5.2000E+2  7.9000E+2  0.0000E+0  1.8000E+1
   86   Au                  5.2000E+2  7.3000E+2  0.0000E+0  1.8000E+1
   87   Au                  8.2000E+2  3.0000E+2  0.0000E+0  1.8000E+1
   88   Au                  1.2100E+3  5.5000E+2  0.0000E+0  1.8000E+1
   89   Au                  1.6300E+3  5.5000E+2  0.0000E+0  1.8000E+1
   90   Au                  1.9300E+3  5.5000E+2  0.0000E+0  1.8000E+1
   91   Ag                  8.2000E+2  6.0000E+1  0.0000E+0  1.2000E+1
   92   Au                  1.2100E+3  3.1000E+2  0.0000E+0  1.8000E+1
   93   Au                  1.6300E+3  3.1000E+2  0.0000E+0  1.8000E+1
   94   Au                  1.9300E+3  3.1000E+2  0.0000E+0  1.8000E+1
   95   Au                  8.2000E+2  4.2000E+2  0.0000E+0  1.8000E+1
   96   Au                  1.2100E+3  6.7000E+2  0.0000E+0  1.8000E+1
   97   Au                  1.6300E+3  6.7000E+2  0.0000E+0  1.8000E+1
   98   Ag                  1.9300E+3  6.7000E+2  0.0000E+0  1.2000E+1
   99   Au                  8.2000E+2  1.8000E+2  0.0000E+0  1.8000E+1
  100   Au                  1.2100E+3  4.3000E+2  0.0000E+0  1.8000E+1
  101   Au                  1.6300E+3  4.3000E+2  0.0000E+0  1.8000E+1
  102   Au                  1.9300E+3  4.3000E+2  0.0000E+0  1.8000E+1
  103   Au                  8.2000E+2  2.4000E+2  0.0000E+0  1.8000E+1
  104   Au                  1.2100E+3  4.9000E+2  0.0000E+0  1.8000E+1
  105   Au                  1.6300E+3  4.9000E+2  0.0000E+0  1.8000E+1
  106   Au                  1.9300E+3  4.9000E+2  0.0000E+0  1.8000E+1
  107   Au                  8.2000E+2  0.0000E+0  0.0000E+0  1.8000E+1
  108   Au                  1.2100E+3  2.5000E+2  0.0000E+0  1.8000E+1
  109   Au                  1.6300E+3  2.5000E+2  0.0000E+0  1.8000E+1
  110   Au                  8.2000E+2  3.6000E+2  0.0000E+0  1.8000E+1
  111   Au                  1.2100E+3  6.1000E+2  0.0000E+0  1.8000E+1
  112   Au                  1.6300E+3  6.1000E+2  0.0000E+0  1.8000E+1
  113   Au                  1.9300E+3  6.1000E+2  0.0000E+0  1.8000E+1
  114   Au                  8.2000E+2  1.2000E+2  0.0000E+0  1.8000E+1
  115   Au                  1.2100E+3  3.7000E+2  0.0000E+0  1.8000E+1
  116   Au                  1.6300E+3  3.7000E+2  0.0000E+0  1.8000E+1
  117   Au                  1.9300E+3  3.7000E+2  0.0000E+0  1.8000E+1
  118   Au                  6.0000E+2  4.6000E+2  0.0000E+0  1.8000E+1
  119   Au                  8.8000E+2  5.4000E+2  0.0000E+0  1.8000E+1
  120   Au                  8.8000E+2  4.8000E+2  0.0000E+0  1.8000E+1
  121   Au                  8.8000E+2  6.0000E+1  0.0000E+0  1.8000E+1
  122   Au                  1.2700E+3  3.1000E+2  0.0000E+0  1.8000E+1
  123   Au                  1.6900E+3  3.1000E+2  0.0000E+0  1.8000E+1
  124   Au                  1.6900E+3  7.9000E+2  0.0000E+0  1.8000E+1
  125   Au                  8.8000E+2  0.0000E+0  0.0000E+0  1.8000E+1
  126   Au                  1.2700E+3  2.5000E+2  0.0000E+0  1.8000E+1
  127   Au                  1.6900E+3  2.5000E+2  0.0000E+0  1.8000E+1
  128   Au                  1.6900E+3  7.3000E+2  0.0000E+0  1.8000E+1
  129   Au                  1.0000E+3  5.4000E+2  0.0000E+0  1.8000E+1
  130   Au                  1.0000E+3  4.8000E+2  0.0000E+0  1.8000E+1
  131   Au                  8.8000E+2  3.0000E+2  0.0000E+0  1.8000E+1
  132   Au                  8.8000E+2  2.4000E+2  0.0000E+0  1.8000E+1
  133   Ag                  1.0000E+3  6.0000E+1  0.0000E+0  1.2000E+1
  134   Au                  1.3900E+3  3.1000E+2  0.0000E+0  1.8000E+1
  135   Au                  1.8100E+3  3.1000E+2  0.0000E+0  1.8000E+1
  136   Au                  1.8100E+3  7.9000E+2  0.0000E+0  1.8000E+1
  137   Au                  1.0000E+3  0.0000E+0  0.0000E+0  1.8000E+1
  138   Au                  1.3900E+3  2.5000E+2  0.0000E+0  1.8000E+1
  139   Ag                  1.8100E+3  2.5000E+2  0.0000E+0  1.2000E+1
  140   Au                  1.8100E+3  7.3000E+2  0.0000E+0  1.8000E+1
  141   Au                  1.0000E+3  3.0000E+2  0.0000E+0  1.8000E+1
  142   Au                  1.0000E+3  2.4000E+2  0.0000E+0  1.8000E+1
  143   Au                  6.6000E+2  6.4000E+2  0.0000E+0  1.8000E+1
  144   Au                  6.3250E+2  7.3750E+2  0.0000E+0  3.1500E+1
  145   Au                  6.6000E+2  5.8000E+2  0.0000E+0  1.8000E+1
  146   Au                  6.6000E+2  4.0000E+2  0.0000E+0  1.8000E+1
  147   Au                  6.6000E+2  5.2000E+2  0.0000E+0  1.8000E+1
  148   Au                  6.6000E+2  2.8000E+2  0.0000E+0  1.8000E+1
  149   Au                  9.4000E+2  5.4000E+2  0.0000E+0  1.8000E+1
  150   Ag                  9.4000E+2  4.8000E+2  0.0000E+0  1.2000E+1
  151   Au                  6.6000E+2  3.4000E+2  0.0000E+0  1.8000E+1
  152   Au                  1.0600E+3  5.4000E+2  0.0000E+0  1.8000E+1
  153   Au                  1.0600E+3  4.8000E+2  0.0000E+0  1.8000E+1
  154   Au                  6.6000E+2  4.6000E+2  0.0000E+0  1.8000E+1
  155   Au                  9.4000E+2  6.0000E+1  0.0000E+0  1.8000E+1
  156   Ag                  1.3300E+3  3.1000E+2  0.0000E+0  1.2000E+1
  157   Au                  1.7500E+3  3.1000E+2  0.0000E+0  1.8000E+1
  158   Ag                  1.7500E+3  7.9000E+2  0.0000E+0  1.2000E+1
  159   Au                  9.4000E+2  0.0000E+0  0.0000E+0  1.8000E+1
  160   Au                  1.3300E+3  2.5000E+2  0.0000E+0  1.8000E+1
  161   Au                  1.7500E+3  2.5000E+2  0.0000E+0  1.8000E+1
  162   Au                  1.7500E+3  7.3000E+2  0.0000E+0  1.8000E+1
  163   Au                  9.4000E+2  3.0000E+2  0.0000E+0  1.8000E+1
  164   Ag                  9.4000E+2  2.4000E+2  0.0000E+0  1.2000E+1
  165   Au                  1.0600E+3  6.0000E+1  0.0000E+0  1.8000E+1
  166   Au                  1.4500E+3  3.1000E+2  0.0000E+0  1.8000E+1
  167   Au                  1.0600E+3  0.0000E+0  0.0000E+0  1.8000E+1
  168   Au                  1.4500E+3  2.5000E+2  0.0000E+0  1.8000E+1
  169   Au                  1.8700E+3  2.5000E+2  0.0000E+0  1.8000E+1

readInputFile> Individual geometry characteristic(s):

 scatID Details
    1   Mie with ncoats= 0
    2   Mie with ncoats= 0
    3   Mie with ncoats= 0
    4   Mie with ncoats= 0
    5   Mie with ncoats= 0
    6   Mie with ncoats= 0
    7   Mie with ncoats= 0
    8   Mie with ncoats= 0
    9   Mie with ncoats= 0
   10   Mie with ncoats= 0
   11   Mie with ncoats= 0
   12   Mie with ncoats= 0
   13   Mie with ncoats= 0
   14   Mie with ncoats= 0
   15   Mie with ncoats= 0
   16   Mie with ncoats= 0
   17   Mie with ncoats= 0
   18   Mie with ncoats= 0
   19   Mie with ncoats= 0
   20   Mie with ncoats= 0
   21   Mie with ncoats= 0
   22   Mie with ncoats= 0
   23   Mie with ncoats= 0
   24   Mie with ncoats= 0
   25   Mie with ncoats= 0
   26   Mie with ncoats= 0
   27   Mie with ncoats= 0
   28   Mie with ncoats= 0
   29   Mie with ncoats= 0
   30   Mie with ncoats= 0
   31   Mie with ncoats= 0
   32   Mie with ncoats= 0
   33   Mie with ncoats= 0
   34   Mie with ncoats= 0
   35   Mie with ncoats= 0
   36   Mie with ncoats= 0
   37   Mie with ncoats= 0
   38   Mie with ncoats= 0
   39   Mie with ncoats= 0
   40   Mie with ncoats= 0
   41   Mie with ncoats= 0
   42   Mie with ncoats= 0
   43   Mie with ncoats= 0
   44   Mie with ncoats= 0
   45   Mie with ncoats= 0
   46   Mie with ncoats= 0
   47   Mie with ncoats= 0
   48   Mie with ncoats= 0
   49   Mie with ncoats= 0
   50   Mie with ncoats= 0
   51   Mie with ncoats= 0
   52   Mie with ncoats= 0
   53   Mie with ncoats= 0
   54   Mie with ncoats= 0
   55   Mie with ncoats= 0
   56   Mie with ncoats= 0
   57   Mie with ncoats= 0
   58   Mie with ncoats= 0
   59   Mie with ncoats= 0
   60   Mie with ncoats= 0
   61   Mie with ncoats= 0
   62   Mie with ncoats= 0
   63   Mie with ncoats= 0
   64   Mie with ncoats= 0
   65   Mie with ncoats= 0
   66   Mie with ncoats= 0
   67   Mie with ncoats= 0
   68   Mie with ncoats= 0
   69   Mie with ncoats= 0
   70   Mie with ncoats= 0
   71   Mie with ncoats= 0
   72   Mie with ncoats= 0
   73   Mie with ncoats= 0
   74   Mie with ncoats= 0
   75   Mie with ncoats= 0
   76   Mie with ncoats= 0
   77   Mie with ncoats= 0
   78   Mie with ncoats= 0
   79   Mie with ncoats= 0
   80   Mie with ncoats= 0
   81   Mie with ncoats= 0
   82   Mie with ncoats= 0
   83   Mie with ncoats= 0
   84   Mie with ncoats= 0
   85   Mie with ncoats= 0
   86   Mie with ncoats= 0
   87   Mie with ncoats= 0
   88   Mie with ncoats= 0
   89   Mie with ncoats= 0
   90   Mie with ncoats= 0
   91   Mie with ncoats= 0
   92   Mie with ncoats= 0
   93   Mie with ncoats= 0
   94   Mie with ncoats= 0
   95   Mie with ncoats= 0
   96   Mie with ncoats= 0
   97   Mie with ncoats= 0
   98   Mie with ncoats= 0
   99   Mie with ncoats= 0
  100   Mie with ncoats= 0
  101   Mie with ncoats= 0
  102   Mie with ncoats= 0
  103   Mie with ncoats= 0
  104   Mie with ncoats= 0
  105   Mie with ncoats= 0
  106   Mie with ncoats= 0
  107   Mie with ncoats= 0
  108   Mie with ncoats= 0
  109   Mie with ncoats= 0
  110   Mie with ncoats= 0
  111   Mie with ncoats= 0
  112   Mie with ncoats= 0
  113   Mie with ncoats= 0
  114   Mie with ncoats= 0
  115   Mie with ncoats= 0
  116   Mie with ncoats= 0
  117   Mie with ncoats= 0
  118   Mie with ncoats= 0
  119   Mie with ncoats= 0
  120   Mie with ncoats= 0
  121   Mie with ncoats= 0
  122   Mie with ncoats= 0
  123   Mie with ncoats= 0
  124   Mie with ncoats= 0
  125   Mie with ncoats= 0
  126   Mie with ncoats= 0
  127   Mie with ncoats= 0
  128   Mie with ncoats= 0
  129   Mie with ncoats= 0
  130   Mie with ncoats= 0
  131   Mie with ncoats= 0
  132   Mie with ncoats= 0
  133   Mie with ncoats= 0
  134   Mie with ncoats= 0
  135   Mie with ncoats= 0
  136   Mie with ncoats= 0
  137   Mie with ncoats= 0
  138   Mie with ncoats= 0
  139   Mie with ncoats= 0
  140   Mie with ncoats= 0
  141   Mie with ncoats= 0
  142   Mie with ncoats= 0
  143   Mie with ncoats= 0
  144   Mie with ncoats= 0
  145   Mie with ncoats= 0
  146   Mie with ncoats= 0
  147   Mie with ncoats= 0
  148   Mie with ncoats= 0
  149   Mie with ncoats= 0
  150   Mie with ncoats= 0
  151   Mie with ncoats= 0
  152   Mie with ncoats= 0
  153   Mie with ncoats= 0
  154   Mie with ncoats= 0
  155   Mie with ncoats= 0
  156   Mie with ncoats= 0
  157   Mie with ncoats= 0
  158   Mie with ncoats= 0
  159   Mie with ncoats= 0
  160   Mie with ncoats= 0
  161   Mie with ncoats= 0
  162   Mie with ncoats= 0
  163   Mie with ncoats= 0
  164   Mie with ncoats= 0
  165   Mie with ncoats= 0
  166   Mie with ncoats= 0
  167   Mie with ncoats= 0
  168   Mie with ncoats= 0
  169   Mie with ncoats= 0

readInputFile> Dielectric functions for (coated) Mie scatterer(s):

 scatID volID Label
    1     0     Au
    2     0     Ag
    3     0     Au
    4     0     Au
    5     0     Au
    6     0     Au
    7     0     Ag
    8     0     Au
    9     0     Au
   10     0     Au
   11     0     Au
   12     0     Au
   13     0     Au
   14     0     Au
   15     0     Ag
   16     0     Au
   17     0     Ag
   18     0     Au
   19     0     Au
   20     0     Ag
   21     0     Au
   22     0     Au
   23     0     Au
   24     0     Ag
   25     0     Au
   26     0     Au
   27     0     Au
   28     0     Au
   29     0     Au
   30     0     Au
   31     0     Au
   32     0     Au
   33     0     Ag
   34     0     Au
   35     0     Ag
   36     0     Au
   37     0     Au
   38     0     Ag
   39     0     Au
   40     0     Au
   41     0     Au
   42     0     Au
   43     0     Au
   44     0     Au
   45     0     Ag
   46     0     Au
   47     0     Au
   48     0     Au
   49     0     Au
   50     0     Au
   51     0     Au
   52     0     Au
   53     0     Au
   54     0     Au
   55     0     Au
   56     0     Au
   57     0     Au
   58     0     Au
   59     0     Au
   60     0     Au
   61     0     Au
   62     0     Au
   63     0     Au
   64     0     Au
   65     0     Au
   66     0     Au
   67     0     Au
   68     0     Au
   69     0     Ag
   70     0     Au
   71     0     Au
   72     0     Au
   73     0     Ag
   74     0     Au
   75     0     Au
   76     0     Au
   77     0     Au
   78     0     Ag
   79     0     Au
   80     0     Au
   81     0     Au
   82     0     Ag
   83     0     Au
   84     0     Ag
   85     0     Au
   86     0     Au
   87     0     Au
   88     0     Au
   89     0     Au
   90     0     Au
   91     0     Ag
   92     0     Au
   93     0     Au
   94     0     Au
   95     0     Au
   96     0     Au
   97     0     Au
   98     0     Ag
   99     0     Au
  100     0     Au
  101     0     Au
  102     0     Au
  103     0     Au
  104     0     Au
  105     0     Au
  106     0     Au
  107     0     Au
  108     0     Au
  109     0     Au
  110     0     Au
  111     0     Au
  112     0     Au
  113     0     Au
  114     0     Au
  115     0     Au
  116     0     Au
  117     0     Au
  118     0     Au
  119     0     Au
  120     0     Au
  121     0     Au
  122     0     Au
  123     0     Au
  124     0     Au
  125     0     Au
  126     0     Au
  127     0     Au
  128     0     Au
  129     0     Au
  130     0     Au
  131     0     Au
  132     0     Au
  133     0     Ag
  134     0     Au
  135     0     Au
  136     0     Au
  137     0     Au
  138     0     Au
  139     0     Ag
  140     0     Au
  141     0     Au
  142     0     Au
  143     0     Au
  144     0     Au
  145     0     Au
  146     0     Au
  147     0     Au
  148     0     Au
  149     0     Au
  150     0     Ag
  151     0     Au
  152     0     Au
  153     0     Au
  154     0     Au
  155     0     Au
  156     0     Ag
  157     0     Au
  158     0     Ag
  159     0     Au
  160     0     Au
  161     0     Au
  162     0     Au
  163     0     Au
  164     0     Ag
  165     0     Au
  166     0     Au
  167     0     Au
  168     0     Au
  169     0     Au

readInputFile> Finished parsing 10 keywords


mapNF> ===== Wavelength:   514.00 (nm) ======================

solve> Prestaging...
solve> Staging and solving/inverting...
